/*
Исполнитель “Раздвоитель” преобразует натуральные числа. У него есть две команды: “Вычесть 1” и “Разделить на 2”, первая команда уменьшает число на 1, вторая команда уменьшает число в два раза, если оно чётное, иначе происходит ошибка.

Входные данные
Дано два натуральных числа A и B (A>B).

Выходные данные
Напишите алгоритм для Развоителя, который преобразует число A в число B и при этом содержит минимальное число команд. Команды алгоритма нужно выводить по одной в строке, первая команда обозначается, как -1, вторая команда как :2.
*/

#include <iostream>

int main() {
	int a, b;
	std::cin >> a >> b;
	while (a != b) {
		if (a % 2 || a / 2 < b) {
			std::cout << "-1\n";
			a--;
			continue;
		}
		std::cout << ":2\n";
		a /= 2;
	}
}