/*
Дан массив, состоящий из целых чисел. Напишите программу, которая выводит те элементы массива, которые являются чётными числами.

Входные данные
Сначала задано число N — количество элементов в массиве (1≤N≤100). Далее через пробел записаны N чисел — элементы массива. Массив состоит из целых чисел.

Выходные данные
Необходимо вывести все четные элементы массива (то есть те элементы, которые являются четными числами).
*/

#include <iostream>
using namespace std;

int main() {
  int size, arr[100];
  cin >> size;
  for (int i = 0; i < size; i++) {
    cin >> arr[i];
  }
  for (int i = 0; i < size; i++) {
    if (arr[i] % 2 == 0) {
      cout << arr[i] << endl;
    }
  }
}