/*
Дано число X. Требуется перевести это число в римскую систему счисления.

Входные данные
Дано число X в десятичной системе счисления (1  ≤  X  ≤  100).

Выходные данные
Выведите X в римской системе счисления.
*/

#include <iostream>
using namespace std;

int main() {
  int n;
  cin >> n;
  for(;n - 100 >= 0; n -= 100) {
    cout << "C";
  }
  for(;n - 90 >= 0; n -= 90) {
    cout << "XC";
  }
  for(;n - 50 >= 0; n -= 50) {
    cout << "L";
  }
  for(;n - 40 >= 0; n -= 40) {
    cout << "XL";
  }
  for(;n - 10 >= 0; n -= 10) {
    cout << "X";
  }
  for(;n - 9 >= 0; n -= 9) {
    cout << "IX";
  }
  for(;n - 5 >= 0; n -= 5) {
    cout << "V";
  }
  for(;n - 4 >= 0; n -= 4) {
    cout << "IV";
  }
  for(;n - 1 >= 0; n -= 1) {
    cout << "I";
  }
}